[
    {
      "id": 1,
      "name": "VMware SD-WAN Edge and SD-WAN Orchestrator updates address multiple security vulnerabilities",
      "shortDescription": "Multiple vulnerabilities in VMware SD-WAN were privately reported to VMware. Patches and instructions are available to remediate the vulnerabilities in affected VMware products.",
      "fullDescription": "<h1>Advisory Name: VMware SD-WAN Edge and SD-WAN Orchestrator updates address multiple security vulnerabilities.</h1><p>For purposes of better clarity and context, below sections provide the advisory summary and potential business impact to your environment:</p><h2>Affected products:</h2><ul><li>VMware SD-WAN Edge 4.5.x/5.x</li><li>VMware SD-WAN Orchestrator 5.x</li></ul><h2>Advisory Summary:</h2><p>Multiple vulnerabilities in VMware SD-WAN were privately reported to VMware. Patches and instructions are available to remediate the vulnerabilities in affected VMware products.</p><ul><li><strong>CVE-2024-22246:</strong> VMware SD-WAN Edge contains an unauthenticated command injection vulnerability potentially leading to remote code execution.</li><li><strong>CVE-2024-22247:</strong> VMware SD-WAN Edge contains a missing authentication and protection mechanism vulnerability.</li><li><strong>CVE-2024-22248:</strong> VMware SD-WAN Orchestrator contains an open redirect vulnerability.</li></ul><h2>Business Impact:</h2><p>If and when successfully executed, this attack can cause significant negative impact to confidentiality, integrity and/or availability aspects of the technology assets.<h2>SOC Action:</h2><ol><li>After reviewing the advisory, it was confirmed that a successful exploit of <ul><li><strong>CVE-2024-22246:</strong> could allow malicious actor with local access to the Edge Router UI during activation may be able to perform a command injection attack that could lead to full control of the router.</li><li><strong>CVE-2024-22247:</strong> could allow malicious actor with physical access to the SD-WAN Edge appliance during activation can potentially exploit this vulnerability to access the BIOS configuration. In addition, the malicious actor may be able to exploit the default boot priority configured.</li><li><strong>CVE-2024-22248:</strong> could allow malicious actor may be able to redirect a victim to an attacker controlled domain due to improper path handling leading to sensitive information disclosure.</li></ul></li></ol><h2>Recommendation:</h2><ol><li>Please update to fixed versions <ul><li>VMware SD-WAN Edge 4.5.1+/5.1+</li><li>VMware SD-WAN Orchestrator 5.1+</li></ul></li><li>Please refer to the following link for upgrades, patches and workarounds: <a href='https://www.vmware.com/security/advisories/VMSA-2024-0008.html'>https://www.vmware.com/security/advisories/VMSA-2024-0008.html</a></li></ol>"
    },

    {
      "id": 2,
      "name": "New OpenSSH Vulnerability Could Lead to RCE as Root on Linux Systems",
      "shortDescription": "The vulnerability, known as “regreSSHion,” resides in the OpenSSH server component (sshd). It results from a signal handler race condition. It affects the default configuration of OpenSSH and does not require user interaction. Successful exploitation has been demonstrated on 32-bit Linux/glibc systems with address space layout randomization.",
      "fullDescription": "<h1>Advisory Name: New OpenSSH Vulnerability Could Lead to RCE as Root on Linux Systems</h1><h2>Affected Products:</h2><ul><li>OpenSSH servers on Linux between 8.5p1 and 9.7p1. Versions prior to 4.4p1 are also at risk unless patched for CVE-2006-5051 and CVE-2008-4109.</li></ul><p>For purposes of better clarity and context, below sections provide the advisory summary and potential business impact to the NEXtCARE environment:</p><h2>Advisory Summary:</h2><p>The vulnerability, known as “regreSSHion,” resides in the OpenSSH server component (sshd). It results from a signal handler race condition. It affects the default configuration of OpenSSH and does not require user interaction. Successful exploitation has been demonstrated on 32-bit Linux/glibc systems with address space layout randomization. Under lab conditions, the attack requires approximately 6-8 hours of continuous connections up to the maximum the server will accept.</p><ul><li><strong>CVE-2024-6387:</strong> The vulnerability, codenamed “regreSSHion,” results from a signal handler race condition in OpenSSH’s server. It allows unauthenticated remote code execution (RCE) with root privileges on glibc-based Linux systems. It does not authenticate within the LoginGraceTime (which is 120 seconds by default, or 600 seconds in older OpenSSH versions), sshd’s SIGALRM handler is called asynchronously.</li><li><strong>CVE-2006-5051:</strong> The signal handler was vulnerable to a race condition that could be exploited to perform a pre-authentication denial of service. On portable OpenSSH, this vulnerability could theoretically lead to pre-authentication remote code execution if GSSAPI authentication is enabled, but the likelihood of successful exploitation appears remote.</li><li><strong>CVE-2008-4109:</strong> Systems affected by this issue suffer from lots of zombie sshd processes. Processes stuck with a “[net]” process title have also been observed. Over time, enough processes may accumulate such that further login attempts are impossible. Presence of these processes does not indicate active exploitation of this vulnerability. It is possible to trigger this denial-of-service condition by accident.</li></ul><h2>Business Impact:</h2><p>When successfully executed, this attack can cause significant negative impact to confidentiality, integrity, and/or availability aspects of the technology assets.</p><h2>Relevance to NEXtCARE:</h2><p>To be determined</p><h2>SOC Action:</h2><ol><li>After review of the advisory, it was confirmed that a successful exploit could allow a remote attacker to gain full root access and execute remote code execution commands.</li></ol><h2>Recommendations:</h2><ol><li>Use network-based controls to restrict SSH access. Consider implementing firewall rules or access control lists (ACLs) to limit SSH connections to authorized hosts.</li><li>Please upgrade to OpenSSH 9.8 or later. Refer to the attached link for the suggested workarounds: <a href='https://access.redhat.com/security/cve/CVE-2024-6387'>https://access.redhat.com/security/cve/CVE-2024-6387</a>.</li></ol>"
    },
    {
      "id": 3,
      "name": "Chinese Hackers Exploiting Cisco Switches Zero-Day to Deliver Malware",
      "shortDescription": "A vulnerability in the CLI of Cisco NX-OS Software was identified after a Chinese-nexus cyber espionage group named Velvet Ant exploited this zero-day flaw in Cisco NX-OS Software used in its switches, to deliver a malware.",
      "fullDescription": "A vulnerability in the CLI of Cisco NX-OS Software was identified after a Chinese-nexus cyber espionage group named Velvet Ant exploited this zero-day flaw in Cisco NX-OS Software used in its switches, to deliver a malware. CVE-2024-20399: This vulnerability allows a user with Administrator privileges to execute commands on the underlying operating system without enabling the bash-shell feature and without triggering system syslog messages showing that the user executed the run bash command. This could help a user with Administrator privileges hide the execution of shell commands on the device.",
      "recommendations": [
    "Educate users about cybersecurity best practices, including identifying phishing attempts and avoiding suspicious attachments or links.",
    "Regularly update all software, including operating systems and applications, to patch vulnerabilities.",
    "Don’t allow Macros for unknown MSOffice files.",
    "Ensure that email server is configured to block any suspicious attached files.",
    "Implement strong authentication methods, such as multi-factor authentication (MFA), for all critical systems and applications.",
    "Implement a robust backup routine with backups stored offline and regularly tested for recoverability."
  ]
    },
    {
      "id": 4,
      "name": "Golang-Based Zergeca Botnet Powerful DDoS Attacks",
      "shortDescription": "The Zergeca botnet, written in Golang, is a sophisticated threat capable of various malicious activities, including DDoS attacks, proxying, scanning, self-upgrading, persistence, file transfer, reverse shell, and data collection. It employs DNS-over-HTTPS (DoH) and the Smux library for secure C2 communications.",
      "fullDescription": "The Zergeca botnet, written in Golang, is a sophisticated threat capable of various malicious activities, including DDoS attacks, proxying, scanning, self-upgrading, persistence, file transfer, reverse shell, and data collection. It employs DNS-over-HTTPS (DoH) and the Smux library for secure C2 communications. The botnet is linked to the IP address 84.54.51[.]82, previously associated with the Mirai botnet, suggesting that experienced threat actors are behind it. Zergeca has notably targeted Canada, Germany, and the U.S. with ACK flood DDoS attacks between early and mid-June 2024. Zergeca's functionality is divided into four modules: persistence, proxy, silivaccine, and zombie. These modules enable the botnet to establish persistence, implement proxying, remove competing malware, and report sensitive information to its C2 server while supporting various DDoS attacks and other malicious activities. The use of advanced evasion tactics, such as modified UPX packing and XOR encryption, along with its multi-functional capabilities, makes Zergeca a significant and evolving cyber threat.",
  "recommendations": [
    "Educate users about cybersecurity best practices, including identifying phishing attempts and avoiding suspicious attachments or links.",
    "Regularly update all software, including operating systems and applications, to patch vulnerabilities.",
    "Don’t allow Macros for unknown MSOffice files.",
    "Ensure that email server is configured to block any suspicious attached files.",
    "Implement strong authentication methods, such as multi-factor authentication (MFA), for all critical systems and applications.",
    "Implement a robust backup routine with backups stored offline and regularly tested for recoverability."
  ]
    },
    {
      "id": 5,
      "name": "Volcano Demon Ransomware Threat",
      "shortDescription": "Researchers have identified a new ransomware threat actor named “Volcano Demon”, responsible for recent attacks utilizing the LukaLocker encryptor. This group has carried out several successful attacks in the past two weeks, locking both Windows, Linux workstations and servers by exploiting common administrative credentials.",
      "fullDescription": "Researchers have identified a new ransomware threat actor named “Volcano Demon”, responsible for recent attacks utilizing the LukaLocker encryptor. This group has carried out several successful attacks in the past two weeks, locking both Windows, Linux workstations and servers by exploiting common administrative credentials. The attacker first exfiltrates data to C2 servers, following which the files are encrypted with a “.nba” file extension. The attack vector includes common administrative credentials harvested from the network. The threat actor features no leak site and instead uses threatening phone calls to leadership and IT executives to demand payment.",
      "recommendations": [
    "Educate users about cybersecurity best practices, including identifying phishing attempts and avoiding suspicious attachments or links.",
    "Regularly update all software, including operating systems and applications, to patch vulnerabilities.",
    "Don’t allow Macros for unknown MSOffice files.",
    "Ensure that email server is configured to block any suspicious attached files.",
    "Implement strong authentication methods, such as multi-factor authentication (MFA), for all critical systems and applications.",
    "Implement a robust backup routine with backups stored offline and regularly tested for recoverability."
  ]
    },
    {
      "id": 6,
      "name": "Chinese Hackers Exploiting Cisco Switches Zero-Day to Deliver Malware",
      "shortDescription": "A vulnerability in the CLI of Cisco NX-OS Software was identified after a Chinese-nexus cyber espionage group named Velvet Ant exploited this zero-day flaw in Cisco NX-OS Software used in its switches, to deliver a malware.",
      "fullDescription": "A vulnerability in the CLI of Cisco NX-OS Software was identified after a Chinese-nexus cyber espionage group named Velvet Ant exploited this zero-day flaw in Cisco NX-OS Software used in its switches, to deliver a malware. CVE-2024-20399: This vulnerability allows a user with Administrator privileges to execute commands on the underlying operating system without enabling the bash-shell feature and without triggering system syslog messages showing that the user executed the run bash command. This could help a user with Administrator privileges hide the execution of shell commands on the device.",
      "recommendations": [
    "Educate users about cybersecurity best practices, including identifying phishing attempts and avoiding suspicious attachments or links.",
    "Regularly update all software, including operating systems and applications, to patch vulnerabilities.",
    "Don’t allow Macros for unknown MSOffice files.",
    "Ensure that email server is configured to block any suspicious attached files.",
    "Implement strong authentication methods, such as multi-factor authentication (MFA), for all critical systems and applications.",
    "Implement a robust backup routine with backups stored offline and regularly tested for recoverability."
  ]
    }
  ]
  